3. PANDAS
Pandas is a Python library for data wrangling and analysis. It is built around a data structure calledtheDataFrame that is modeled after the R DataFrame. In contrast to NumPy, which requires that all entriesinan array be of the same type, pandas allows each column to have a separate type. Another valuabletoolprovided by pandas is its ability to ingest from a great variety of file formats and databases, likeSQL, Excelfiles, and comma-separated values (CSV) files.

In [4]:
# The following is an example of creating a DataFrame using a dictionary:
import pandas as pd
# create a simple dataset of people
data = {'Name': ["John", "Anna", "Peter", "Linda"],
'Location': ["New York", "Paris", "Berlin", "London"],'Age': [24, 13, 53, 33]
}
data_pandas = pd.DataFrame(data)
display(data_pandas)

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   53
3  Linda    London   33

In [18]:
import numpy as np
import pandas as pd

# numbers = np.arange(10)
# numbers = np.arange(10, 50, 5)
numbers = np.arange(0, 100, 10)
numbers

array([ 0, 10, 20, 30, 40, 50, 60, 70, 80, 90])

In [19]:
numbers_series = pd.Series(numbers)
numbers_series

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [29]:
# fake_df = pd.DataFrame('/home/user/Documents/School Stuff/2024/FS2024/APT3010A/FND Dataset/fake.csv')
fake_df = pd.read_csv('/home/user/Documents/School Stuff/2024/FS2024/APT3010A/FND Dataset/true.csv')
# fake_df.head()  # Display the first few rows of the DataFrame
fake_df.tail()

,title,text,subject,date
21412,'Fully committed' NATO backs new U.S. approach...,BRUSSELS (Reuters) - NATO allies on Tuesday we...,worldnews,"August 22, 2017"
21413,LexisNexis withdrew two products from Chinese ...,"LONDON (Reuters) - LexisNexis, a provider of l...",worldnews,"August 22, 2017"
21414,Minsk cultural hub becomes haven from authorities,MINSK (Reuters) - In the shadow of disused Sov...,worldnews,"August 22, 2017"
21415,Vatican upbeat on possibility of Pope Francis ...,MOSCOW (Reuters) - Vatican Secretary of State ...,worldnews,"August 22, 2017"
21416,Indonesia to buy $1.14 billion worth of Russia...,JAKARTA (Reuters) - Indonesia will buy 11 Sukh...,worldnews,"August 22, 2017"

In [44]:
np.random.seed(0)
arr = np.random.randint(1001, size = (4, 6)).reshape(8, 3)
arr[::-1, ::-1]

brit = {
    'Title': ["Blackout", "Circus", "Britney Jean", "Glory"],
    'First single': ["Gimme More", "Womanizer", "Work Bitch", "Make Me..."],
    'Year': [2007, 2008, 2013, 2016]
}
data_pandas = pd.DataFrame(brit)
display(data_pandas)

          Title First single  Year
0      Blackout   Gimme More  2007
1        Circus    Womanizer  2008
2  Britney Jean   Work Bitch  2013
3         Glory   Make Me...  2016